"""
分类：
    简单行列索引*
    列表索引*
    范围索引*
    布尔索引
    多维索引*
"""

import torch

torch.manual_seed(24)
t1 = torch.randint(1,10,(5,5))
print(f"t1:{t1}")
print('*'*50)

#todo 1.简单行列索引
print(f't1:{t1[2,:]}')  #打印第2行
print(f't1:{t1[:,2]}')  #打印第2列
print('*'*50)

#todo 2.列表索引
print(f't1:{t1[[0,3],[1,4]]}')  #返回(0,1),(3,4)

print(f't1:{t1[[[0],[1]],[2,3]]}') #返回0，1行的2，3列四个数据
print('*'*50)

#todo 3.范围索引
print(f't1:{t1[:3,:2]}') #返回前三行两列数据
print('*'*50)

#todo 4.布尔索引
print(f't1:{t1[ 1, t1[1,:] >  5]}') #找出第1行大于5的数据
print('*'*50)

#todo 5.多维索引
t2 = torch.randint(1,10,(2,3,4)) #2个三行四列的张量
print(f't2:{t2[:,:,:]}') #打印两个张量
print(f't2:{t2[:,0,:]}') #打印两个张量的第0行
print(f't2:{t2[:,:,0]}') #打印两个张量的第0列

